Tekla.Structures.ModelInternal.FabricatorProject
The FabricatorProject class contains information about fabricator project.

Tekla.Structures.ModelInternal.FabricatorProject.Name
The fabricator project name.

Tekla.Structures.ModelInternal.FabricatorProject.Id
The fabricator project id.

Tekla.Structures.ModelInternal.FabricatorProject.Location
The fabricator project location.

Tekla.Structures.ModelInternal.FabricatorProject.ShareToken
The fabricator share token.

Tekla.Structures.ModelInternal.FabricatorProject.#ctor
Creates a new instance.

Tekla.Structures.ModelInternal.FabricatorProject.GetFabricatorProject
Returns information about the current model's project.
Returns: A FabricatorProject instance on success.

Tekla.Structures.ModelInternal.FabricatorProject.Equals(System.Object)
Determines whether the current instance of FabricatorProject is equal to another instance.
obj: The object to compare with the current instance.
Returns: True if the current instance is equal to the other instance; otherwise, false.

Tekla.Structures.ModelInternal.FabricatorProject.GetHashCode
Returns the hash code for the current instance.
The hash code should be such that if two instances are equal, their hash codes are equal.
Returns: A hash code for the current instance.

Tekla.Structures.ModelInternal.FabricatorProject.Modify
Modifies the current fabricator project information.
Returns: True on success.

Tekla.Structures.ModelInternal.FabricatorProject.GetInfo
Get current fabricator project information.

Tekla.Structures.ModelInternal.FabricatorProject.ToStruct(Tekla.Structures.ModelInternal.dotFabricatorProject_t@)
Copy FabricatorProject to dotFabricatorProject_t.
Info: The project information.

Tekla.Structures.ModelInternal.FabricatorProject.FromStruct(Tekla.Structures.ModelInternal.dotFabricatorProject_t@)
Copy dotFabricatorProject_t to FabricatorProject.
Info: The project information..